zephyrproject-rtos/zephyr/include/zephyr/dt-bindings/reset/ch32v20x_30x-reset.h
/*
 * Copyright (c) 2026 Fiona Behrens
 *
 * SPDX-License-Identifier: Apache-2.0
 */

/**
 * @file
 * @brief CH32 reset controller devicetree helper macros for CH32V20X-V30X.
 * @ingroup reset_controller_ch32
 */

#ifndef ZEPHYR_INCLUDE_DT_BINDINGS_RESET_CH32V20X_30X_RESET_H_
#define ZEPHYR_INCLUDE_DT_BINDINGS_RESET_CH32V20X_30X_RESET_H_

#include "ch32-common.h"

/** @cond INTERNAL_HIDDEN */

/* RCC bus reset register offset */
#define CH32_RESET_BUS_APB2 0x0C
#define CH32_RESET_BUS_APB1 0x10
#define CH32_RESET_BUS_AHB  0x28

/**
 * @name CH32 peripheral reset identifiers
 * @{
 */

/* APB2 peripherals */
#define CH32V20X_V30X_RESET_AFIO   CH32_RESET(APB2, 0)
#define CH32V20X_V30X_RESET_GPIOA  CH32_RESET(APB2, 2)
#define CH32V20X_V30X_RESET_GPIOB  CH32_RESET(APB2, 3)
#define CH32V20X_V30X_RESET_GPIOC  CH32_RESET(APB2, 4)
#define CH32V20X_V30X_RESET_GPIOD  CH32_RESET(APB2, 5)
#define CH32V20X_V30X_RESET_GPIOE  CH32_RESET(APB2, 6)
#define CH32V20X_V30X_RESET_ADC1   CH32_RESET(APB2, 9)
#define CH32V20X_V30X_RESET_ADC2   CH32_RESET(APB2, 10)
#define CH32V20X_V30X_RESET_TIM1   CH32_RESET(APB2, 11)
#define CH32V20X_V30X_RESET_SPI1   CH32_RESET(APB2, 12)
#define CH32V20X_V30X_RESET_TIM8   CH32_RESET(APB2, 13)
#define CH32V20X_V30X_RESET_USART1 CH32_RESET(APB2, 14)
#define CH32V20X_V30X_RESET_TIM9   CH32_RESET(APB2, 19)
#define CH32V20X_V30X_RESET_TIM10  CH32_RESET(APB2, 20)

/* APB1 peripherals */
#define CH32V20X_V30X_RESET_TIM2   CH32_RESET(APB1, 0)
#define CH32V20X_V30X_RESET_TIM3   CH32_RESET(APB1, 1)
#define CH32V20X_V30X_RESET_TIM4   CH32_RESET(APB1, 2)
#define CH32V20X_V30X_RESET_TIM5   CH32_RESET(APB1, 3)
#define CH32V20X_V30X_RESET_TIM6   CH32_RESET(APB1, 4)
#define CH32V20X_V30X_RESET_TIM7   CH32_RESET(APB1, 5)
#define CH32V20X_V30X_RESET_USART6 CH32_RESET(APB1, 6)
#define CH32V20X_V30X_RESET_USART7 CH32_RESET(APB1, 7)
#define CH32V20X_V30X_RESET_USART8 CH32_RESET(APB1, 8)
#define CH32V20X_V30X_RESET_WWDG   CH32_RESET(APB1, 11)
#define CH32V20X_V30X_RESET_SPI2   CH32_RESET(APB1, 14)
#define CH32V20X_V30X_RESET_SPI3   CH32_RESET(APB1, 15)
#define CH32V20X_V30X_RESET_USART2 CH32_RESET(APB1, 17)
#define CH32V20X_V30X_RESET_USART3 CH32_RESET(APB1, 18)
#define CH32V20X_V30X_RESET_USART4 CH32_RESET(APB1, 19)
#define CH32V20X_V30X_RESET_USART5 CH32_RESET(APB1, 20)
#define CH32V20X_V30X_RESET_I2C1   CH32_RESET(APB1, 21)
#define CH32V20X_V30X_RESET_I2C2   CH32_RESET(APB1, 22)
#define CH32V20X_V30X_RESET_USBD   CH32_RESET(APB1, 23)
#define CH32V20X_V30X_RESET_CAN1   CH32_RESET(APB1, 25)
#define CH32V20X_V30X_RESET_CAN2   CH32_RESET(APB1, 26)
#define CH32V20X_V30X_RESET_BKP    CH32_RESET(APB1, 27)
#define CH32V20X_V30X_RESET_PWR    CH32_RESET(APB1, 28)
#define CH32V20X_V30X_RESET_DAC    CH32_RESET(APB1, 29)

/* AHB peripherals */
#define CH32V20X_V30X_RESET_OTGFS  CH32_RESET(AHB, 12)
#define CH32V20X_V30X_RESET_DVP    CH32_RESET(AHB, 13)
#define CH32V20X_V30X_RESET_ETHMAC CH32_RESET(AHB, 14)

/** @} */

/** @endcond */

#endif /* ZEPHYR_INCLUDE_DT_BINDINGS_RESET_CH32V20X_30X_RESET_H_ */
